<script setup>


    import DefaultHeader from '@/layouts/header.vue'; // 引入header(請照抄)
    import DefaultFooter from '@/layouts/footer.vue'; // 引入footer(請照抄)
    import BannerUrl  from '@/img/articles/articles_banner.jpg'; // 更改成banner路徑
    import wrapper from '@/layouts/wrapper.vue'; // 引入wrapper滑動(請照抄)

    const banner_url = BannerUrl; // banner路徑令變數(請照抄)
    
    import { ref } from "vue";
    
    const activeContent = ref('content1');
    const isVisible1 = ref(true);
    const isVisible2 = ref(false);
    const isVisible3 = ref(false);

    const showContent = (e) => {
        activeContent.value = e;
        if(activeContent.value === 'content1'){
            isVisible1.value = true;
            isVisible2.value = false;
            isVisible3.value = false;
            
        }else if(activeContent.value === 'content2'){
            isVisible2.value = true;
            isVisible1.value = false;
            isVisible3.value = false;
        }else if(activeContent.value === 'content3'){
            isVisible3.value = true;
            isVisible1.value = false;
            isVisible2.value = false;
        }
    }
    
    // const showContent = (e) => {
    //     activeContent.value = e;
    
    //     for (let i = 1; i <= 3; i++) {
    //         const isVisible = activeContent.value === `content${i}` ;
    //         [`isVisible${i}`].value = isVisible;
    //     }

    // };

</script>


<template>
    <div>
        <DefaultHeader header-title-zh="專欄文章" header-title-eng="Articles" :bgi="banner_url" /> 
        <wrapper class="articles"> 
        <div id="wannan_top"  v-show="isVisible1">
        <section class="articles_top">
           
            <article class="left">
                <div class="title title_phone">
                    <h1>最新文章</h1>
                </div>

                <h2>年前掃除全攻略 : 三樣神器馬上搞定</h2>
                <h3>2023.12.31</h3>
                <h4>農曆新年即將來臨，象徵著新的一年的開始，而在這個美好的時刻，許多人都迎來了一項傳統的活動 —
                    年前大掃除。這不僅是一種習慣，更是一種將舊歲的塵埃拂去，迎接新年氣象的潔淨仪式。為了確保家居環境在新的一年焕然一新，我們在大掃除前就得提前備妥各種實用的打掃用具。這次，讓我們一同探討三樣超神的工具，這些神奇的道具將為你的大掃除添上一份便利，讓效果超乎你的預期！先來談談懶人必備的超級神器
                    — 萬能清潔機！這不僅是懶人的救星，更是家居清潔的得力助手。不管是地板、沙發，還是窗簾，這小傢伙通通都能輕鬆搞定。吸塵、擦拭、除媒通通不在話下，你想得到的清潔效果，這台小神器都能事半功倍地達成。
                </h4>
                <a href="">Read More</a>

            </article>

            <img src="../img/articles/articles_1.jpg" alt="">
            
        </section>
        </div>
        <div id="know_top" v-show="isVisible2">
        <section class="articles_top">

            <article class="left">
                <div class="title">
                    <h1>最新文章</h1>
                </div>

                <h2>清潔達人的黃金法則：居家清潔五大秘訣</h2>
                <h3>2023.12.31</h3>
                <h4>在追求清潔而健康的居家環境中，掌握一些實用的清潔秘訣是至關重要的。以下是五個讓你成為居家清潔達人的黃金法則：
                    1. 定期深度清潔： 不只是表面，定期進行深度清潔對於家居環境的衛生至關重要。清理床底下、沙發底下、家具角落等常被忽略的區域，可以防止細菌和塵蹣滋生，確保整個家庭的健康。
                    2. 選擇環保清潔劑： 改用環保清潔劑不僅能減少對環境的影響，還能減少對家人健康的風險。天然成分的清潔劑，如檸檬、蘇打粉、白醋等，能夠安全而有效地清潔各種表面。
                    3. 購買高效清潔工具： 選擇高效的清潔工具可以極大提高清潔效率。例如，微纖維抹布能夠更有效地吸附灰塵和細菌，而可調節清潔器具則能應對不同區域的清潔需求。
                    4. 隨手保持整潔： 养成隨手保持整潔的習慣，如隨時將使用完的物品歸位、定期整理物品、清理碗盤等，可以避免家中變得混亂，減少長時間的整理工作。
                    5. 定期更換家居用品： 床單、枕套、浴巾等家居用品容易累積灰塵和細菌，定期更換可以確保家居環境清潔衛生。此外，定期清理和更換空調濾網，有助於維持室內空氣的清新。
                    這些黃金法則不僅讓你的居家環境保持清潔，還有助於創造一個舒適、健康的生活空間。融入這些簡單而有效的清潔習慣，讓你成為真正的居家清潔達人。
                </h4>
                <a href="">Read More</a>

            </article>

            <img src="../img/articles/articles_5.jpg" alt="">

        </section>
        </div>
        <div id="interview_top" v-show="isVisible3">
        <section class="articles_top">

            <article class="left">
                <div class="title">
                    <h1>最新文章</h1>
                </div>

                <h2>董事長LEO想說的話: 浣安馬卡巴卡</h2>
                <h3>2023.12.31</h3>
                <h4>浣安的同仁，每一位都是這家公司的生命力。你們的辛勤工作和專業精神讓我們的服務品質達到了新的高度。每一個角落的清潔，每一次微笑的面對客戶，都展現了你們的敬業態度和對工作的熱愛。
                    我理解清潔工作並不簡單，有時候可能會遇到各種挑戰。但是，正是因為有你們這樣敬業的員工，我們的公司才能夠不斷成長和進步。你們的辛苦工作不僅讓公司繼續蓬勃發展，也為客戶提供了乾淨、整潔的生活環境。我想告訴你們，你們的工作不僅僅是清潔，更是為社會營造舒適宜人的空間，為客戶帶來愉悅的居住體驗。你們每一個人的努力都在造福著更多的人，成為社會中不可或缺的一部分。
                    在這個特殊的時刻，我想向你們謝謝，謝謝你們每天為公司奉獻的心血。也希望你們能夠時刻保持那份熱情和對工作的熱愛，因為你們的努力不僅改變了公司的命運，也塑造了一個更美好的未來。
                    謝謝你們的付出，讓我們攜手共創更美好的明天！
                    
                    
                </h4>
                <a href="">Read More</a>

            </article>

            <img src="../img/articles/articles_9.jpg" alt="">

        </section>
        </div>

        <section class="articles_buttom">

            <aside>
                <h2>文章一覽</h2>
                <ul>
                    <!-- class="color" -->
                    <li>
                        <a href="#" id="btn_wanann"  @click.prevent="showContent('content1')" :class="{ color: activeContent === 'content1' }">浣安小品</a>
                    </li>
                    <li>
                        <a href="#" id="btn_know"  @click.prevent="showContent('content2')" :class="{ color: activeContent === 'content2' }">清潔小知識</a>
                    </li>
                    <li>
                        <a href="#" id="btn_interview" @click.prevent="showContent('content3')" :class="{ color: activeContent === 'content3' }">職人專訪</a>
                    </li>
                    <li>
                        <a href="">品牌聯名</a>
                    </li>
                </ul>
            </aside>

            <div class="articles_all" id="articles_wanann" v-if="activeContent === 'content1'">
              
                <section class="section_all" >
                    <img src="../img/articles/articles_2.jpg" alt="">

                    <article>
                        <h2>愛心關懷，浣安陪您守護愛的長者</h2>
                        <h3>2023.12.31</h3>
                        <p>在高齡化社會的現今，家中的長者需要更多的關愛和照顧。他們的生活品質直接受到居家環境的影響，因此一個清潔、舒適的家居空間變得顯得格外重要。為了滿足這樣的需求，浣安居家清潔服務應運而生。浣安不僅提供專業的清潔服務，更在其中融入愛心關懷，為您的家人打造一個安心、舒適的居家環境。我們深刻理解長者的需求，因此在清潔的同時，注重細節、注重安全，確保長者的居家環境是乾淨、整潔且安全的。
                        </p>
                        <a href="">Read More</a>
                    </article>
                </section>

                <section class="section_all even">
                    <img src="../img/articles/articles_3.jpg" alt="">

                    <article>
                        <h2>時光家政，讓每一刻都成為美好回憶</h2>
                        <h3>2023.12.31</h3>
                        <p>工作繁忙、生活忙碌成了許多家庭的真實寫照。在這樣的環境下，家中的清潔工作往往成為一道難以逾越的障礙。然而，這並不意味著我們就必須將家的清潔放置在次要的位置。浣安居家清潔服務的出現，正是為了解決這樣的困擾。
                            浣安擁有專業的清潔團隊，能夠為您提供全面的居家清潔服務。無論是繁忙的工作日，還是周末的休息時光，我們都能根據您的需求提供靈活的服務時間，讓您在工作與家庭之間找到平衡。
                            我們的清潔人員不僅專業而細心，更能夠迅速高效地完成清潔工作。無論是家中的客廳、臥室、廚房，還是浴室、地板等區域，都能得到仔細周到的清潔，讓您回到家中能夠感受到一股清新和舒適。
                            浣安的服務不僅僅是清潔，更是一種居家生活的品質提升。我們將家居環境打造成悠然舒適的模樣，讓您在疲憊的工作後能夠回到一個舒心的家，享受屬於自己的片刻寧靜。
                            讓我們一同探索，如何透過浣安，讓家不再只是一個居所，而是溫馨幸福的擁有。不再為繁忙的生活而困擾，而是輕鬆地享受一個清潔整潔、舒適愉悅的家居環境。透過浣安居家清潔服務，為您的生活增添一份品質，讓每一天都成為滿滿的幸福時光。
                        </p>
                        <a href="">Read More</a>
                    </article>
                
                </section>

                <section class="section_all">
                    <img src="../img/articles/articles_4.jpg" alt="">

                    <article>
                        <h2>拒絕讓家務事成為時間小偷</h2>
                        <h3>2023.12.31</h3>
                        <p>在現代快節奏的生活中，人們總是不斷地追趕著時間，努力兼顧工作、學習、社交等多方面的需求。時間的管理成了一門藝術，然而，有時我們卻可能忽略了一個潛在的時間小偷，那就是家務事。這些看似琐碎卻不可或缺的家務事情，如果不得當地處理，很容易占用我們寶貴的時間，影響到工作效率和生活品質。家務事如清潔、整理、烹飪等雖然是日常生活中必須的工作，卻也可能成為時間的不輸入。當每天都在忙碌的工作和學習中，回到家中還需花費大量時間處理這些事務，不禁讓人感到疲憊和壓力。因此，我們需要找到方法，拒絕讓家務事成為時間的小偷，使我們能夠更有效地利用時間，過上更有品質的生活。
                        </p>
                        <a href="">Read More</a>
                    </article>

                </section>
        
            </div>

            <div class="articles_all " id="articles_know" v-else-if="activeContent === 'content2'">
               
                <section class="section_all">
                    <img src="../img/articles/articles_6.jpg" alt="">

                    <article>
                        <h2>家居清潔新境界：簡單有效的五大技巧</h2>
                        <h3>2023.12.31</h3>
                        <p>在現代快節奏的生活中，如何在有限的時間內保持家居清潔成為一個挑戰。然而，透過一些簡單卻極為有效的技巧，你可以輕鬆管理家務，打造一個清新整潔的居住環境。以下是五個實用的家居清潔技巧：
                            1. 分段清潔法： 不要讓所有的清潔工作壓在一天完成，這容易讓人感到沮喪。取而代之的是，採用分段清潔法，每天專注於特定的區域或任務。這樣不僅減輕了清潔的負擔，還能確保每個區域都獲得足夠的關注。
                            2. 選擇多功能清潔用具： 使用能夠應對不同清潔需求的多功能清潔工具，例如可以清潔地板、窗戶和桌面的可調式清潔器具。這樣不僅節省了存放空間，還提高了清潔效率。
                            3. 利用清潔劑的最佳時間： 清晨或傍晚是使用清潔劑的最佳時間，因為室內通風較好，清潔劑更容易揮發，不會在空氣中殘留。同時，這也是避免日曬和高溫對清潔劑造成損害的好時機。
                            4. 定期清理常用區域： 經常使用的區域，如廚房、浴室，應該定期進行深度清潔。這包括清潔電器表面、更換濾網、檢查管道等，確保這些區域不成為細菌和異味的藏身之地。
                            5. 培養良好的習慣： 定期整理和清潔是培養良好習慣的一部分。養成每天整理床鋪、定期處理郵件和文件、隨手處理髒污等小習慣，可以使家居始終保持整潔，減少長期清潔的困擾。
                            這些簡單而有效的家居清潔技巧可以幫助你在繁忙的生活中輕鬆應對家務，同時保持一個舒適、健康的居住環境。試著將它們融入你的日常生活中，享受清新整潔的家居空間。
                        </p>
                        <a href="">Read More</a>
                    </article>
                </section>

                <section class="section_all even">
                    <img src="../img/articles/articles_7.jpg" alt="">

                    <article>
                        <h2>不可忽視的清潔死角：家中容易被忽略的區域</h2>
                        <h3>2023.12.31</h3>
                        <p>在日常的居家清潔中，我們往往注重地板、桌面等明顯的區域，但有時卻容易忽略一些不起眼的死角，這些地方可能是細菌和灰塵的藏匿之所。為了維護家居的整潔，讓我們來關注一下這些常被忽略的區域，並發現它們的清潔死角。
                            首先，讓我們來看看家中的電器表面。電視、冰箱、微波爐等表面經常被手觸摸，容易積聚手上的細菌和灰塵。使用濕抹布搭配溫和的清潔劑，可以輕鬆清潔這些表面，保持家電的外觀清新。
                            其次，窗簾底部是另一個容易被忽略的地方。由於長時間的風吹和陽光曝曬，窗簾底部容易積聚灰塵。定期將窗簾取下清洗，或者使用吸塵器清理窗簾底部，可以確保室內空氣的清新。
                            不容忽視的第三個區域是家中的插座和開關。由於它們經常被觸摸，容易成為細菌的潛在藏身之地。使用消毒濕巾或棉花棒輕輕擦拭插座和開關的表面，是一種簡單而有效的清潔方法。
                            廚房水槽的排水口是清潔死角的第四個代表。食物殘渣容易積聚在排水口周圍，引起異味和細菌繁殖。使用小刷子或者專用的排水口清潔劑，能夠輕鬆解決這個問題，確保水槽的清潔衛生。
                            最後，讓我們來關注衣櫥的底部。這個區域經常被忽略，但卻是灰塵和蟎蟲的理想藏身之地。定期清理衣櫥底部，使用除濕劑保持衣物乾燥，可以有效防止細菌和黴菌的滋生。
                        </p>
                        <a href="">Read More</a>
                    </article>
                </section>

                <section class="section_all">
                    <img src="../img/articles/articles_8.jpg" alt="">

                    <article>
                        <h2>清潔小妙招：怎麼有效去除家居異味？</h2>
                        <h3>2023.12.31</h3>
                        <p>在日常生活中，家居異味可能是一個令人頭疼的問題，它可能來自於烹飪、寵物、或者潮濕的環境。然而，除了噴灑空氣清新劑這樣的臨時解決方案，還有一些更為自然且長效的方法，可以有效去除異味，使你的家居環境更加宜人。
                            首先，檸檬片是一個極佳的選擇。將檸檬片放置在可能產生異味的地方，如廚房或冰箱，檸檬的天然香氣可以中和異味，同時帶來一種清新的氛圍。此外，你還可以使用橙子或葡萄柚等柑橘類水果，它們同樣具有良好的除臭效果。
                            另一個簡單而有效的方法是使用咖啡渣。咖啡渣不僅可以中和異味，還能吸收空氣中的濕氣，對於潮濕引起的異味尤其有效。只需將已用的咖啡渣放在一個容器中，然後放置在需要除味的區域，讓它發揮神奇的去味功效。
                            此外，活性碳也是一種被廣泛使用的除臭劑。它能夠吸附並中和空氣中的異味分子，從而有效地清除不愉快的氣味。你可以在家居用品店或網上購買活性碳袋，並放置在衣櫃、鞋櫃、甚至汽車內，讓它持續發揮去味的功效。
                            總之，這些清潔小妙招不僅環保，而且能夠長時間維持你的家居空氣清新。嘗試一下這些方法，讓你的家充滿宜人的香氣，打造一個舒適健康的生活空間。
                                                        
                        </p>
                        <a href="">Read More</a>
                    </article>

                </section>
      
            </div >
            
            <div class="articles_all" id="articles_interview" v-else-if="activeContent === 'content3'">
               

                <section class="section_all">
                    <img src="../img/articles/articles_10.jpg" alt="">

                    <article>
                        <h2>為什麼加入浣安團隊? 讓小鄭告訴你</h2>
                        <h3>2023.12.31</h3>
                        <p>在高齡化社會的現今，家中的長者需要更多的關愛和照顧。他們的生活品質直接受到居家環境的影響，因此一個清潔、舒適的家居空間變得顯得格外重要。為了滿足這樣的需求，浣安居家清潔服務應運而生。浣安不僅提供專業的清潔服務，更在其中融入愛心關懷，為您的家人打造一個安心、舒適的居家環境。我們深刻理解長者的需求，因此在清潔的同時，注重細節、注重安全，確保長者的居家環境是乾淨、整潔且安全的。
                            浣安的清潔服務不僅僅是掃地、拖地那麼簡單，更包括對家具、地板、浴室等各個區域的深度清潔。我們的專業清潔人員接受嚴格的培訓，熟練使用高效的清潔工具和產品，確保清潔過程不僅快速而且徹底。
                            除了專業的清潔服務，浣安更強調愛心關懷的重要性。我們的清潔人員不僅是專業的技術人才，更是愛心和關懷的傳遞者。他們善於與長者溝通，細心聆聽他們的需求，並在清潔過程中給予溫馨的陪伴，使清潔變成一個愉快的過程。
                            讓浣安成為您愛的長者的守護天使，為他們帶來幸福與關懷。透過我們的清潔服務，不僅讓家中環境變得更舒適，更是為長者營造一個充滿愛的家。我們致力於為每一位家庭提供最優質的居家清潔服務，讓您的長者能夠擁有一個溫馨、整潔、舒適的居家環境。
                            
                            
                        </p>
                        <a href="">Read More</a>
                    </article>
                </section>

                <section class="section_all even">
                    <img src="../img/articles/articles_11.jpg" alt="">

                    <article>
                        <h2>黃組長的微笑小故事</h2>
                        <h3>2023.12.31</h3>
                        <p>浣安的同仁，每一位都是這家公司的生命力。你們的辛勤工作和專業精神讓我們的服務品質達到了新的高度。每一個角落的清潔，每一次微笑的面對客戶，都展現了你們的敬業態度和對工作的熱愛。
                            我理解清潔工作並不簡單，有時候可能會遇到各種挑戰。但是，正是因為有你們這樣敬業的員工，我們的公司才能夠不斷成長和進步。你們的辛苦工作不僅讓公司繼續蓬勃發展，也為客戶提供了乾淨、整潔的生活環境。我想告訴你們，你們的工作不僅僅是清潔，更是為社會營造舒適宜人的空間，為客戶帶來愉悅的居住體驗。你們每一個人的努力都在造福著更多的人，成為社會中不可或缺的一部分。
                            在這個特殊的時刻，我想向你們謝謝，謝謝你們每天為公司奉獻的心血。也希望你們能夠時刻保持那份熱情和對工作的熱愛，因為你們的努力不僅改變了公司的命運，也塑造了一個更美好的未來。
                            謝謝你們的付出，讓我們攜手共創更美好的明天！
                            
                            
                        </p>
                        <a href="">Read More</a>
                    </article>
                </section>

                <section class="section_all">
                    <img src="../img/articles/articles_12.jpg" alt="">

                    <article>
                        <h2>浣安小隊給應徵者的建議</h2>
                        <h3>2023.12.31</h3>
                        <p>在現代快節奏的生活中，人們總是不斷地追趕著時間，努力兼顧工作、學習、社交等多方面的需求。時間的管理成了一門藝術，然而，有時我們卻可能忽略了一個潛在的時間小偷，那就是家務事。這些看似琐碎卻不可或缺的家務事情，如果不得當地處理，很容易占用我們寶貴的時間，影響到工作效率和生活品質。家務事如清潔、整理、烹飪等雖然是日常生活中必須的工作，卻也可能成為時間的不輸入。當每天都在忙碌的工作和學習中，回到家中還需花費大量時間處理這些事務，不禁讓人感到疲憊和壓力。因此，我們需要找到方法，拒絕讓家務事成為時間的小偷，使我們能夠更有效地利用時間，過上更有品質的生活。
                            首先，建立一個合理的家務時間表是拒絕時間小偷的有效手段。透過分配每個家庭成員的責任，可以確保家務事得以有效地完成，同時減輕單一成員的負擔。這樣的時間表不僅提高了效率，還能確保每個人都有足夠的時間專注於其他重要的事務。
                            其次，家庭成員之間的良好溝通也是拒絕讓家務事成為時間小偷的關鍵。共同參與家庭事務需要協同合作和相互理解。透過開放的溝通，家庭成員可以共同討論家務事的分配和時間安排，以確保每個人的需求和期望都得到充分考慮。
                            此外，利用科技和智能化工具也是提高家務效率的好方法。例如，使用智能家居設備來自動化某些家務工作，或者利用手機應用程式進行家務事項的管理和提醒，都可以節省大量時間和精力。
                            最後，擁抱一種積極的態度也是拒絕讓家務事成為時間小偷的不二法門。將家務事視為家庭合作的一部分，而不是單一成員的負擔。這種積極的態度不僅有助於提升家庭的和諧氛圍，還能使我們更加滿足於日常生活。
                            總之，拒絕讓家務事成為時間小偷需要建立明確的時間表、加強家庭成員之間的溝通，擁抱科技和智能工具，以及擁抱積極的態度。透過這些方法，我們可以在繁忙的生活中保持高效率，同時確保家庭生活更加有條理和充實。讓時間成為我們的朋友，而非偷走我們寶貴時光的小偷。
                            
                            
                        </p>
                        <a href="">Read More</a>
                    </article>

                </section>
           
            </div>

        </section>


    </wrapper>
    <DefaultFooter />
    </div>
</template>

<style lang="scss">


</style>